In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan] , 'B': [5,np.nan,np.nan], 'C': [1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(thresh=2) 
#By using thresh i.e threshold, we can specify how many minimum nan values should be considered in order to drop the row

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [10]:
df.fillna(value = "Fill the value")
#Use fillna method to fill up the missing values with any desired value

                A               B  C
0               1               5  1
1               2  Fill the value  2
2  Fill the value  Fill the value  3

In [11]:
df.fillna(value = df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [13]:
df['C'].fillna(df['C'].mean())

0    1
1    2
2    3
Name: C, dtype: int64

In [14]:
data =  {'Company' : "GOOG GOOG MSFT MSFT FB FB".split() , 
        'Person' : "Sam Charlie Amy Vanessa Carl Sarah".split(),
        'Sales' : [200,100,340,580,450,100]}

In [15]:
df1 = pd.DataFrame(data)

In [16]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    100
2    MSFT      Amy    340
3    MSFT  Vanessa    580
4      FB     Carl    450
5      FB    Sarah    100

In [18]:
 obj = df1.groupby('Company')

In [20]:
obj.sum()

         Sales
Company
FB         550
GOOG       300
MSFT       920

In [21]:
obj.mean()

         Sales
Company
FB         275
GOOG       150
MSFT       460

In [22]:
df1.groupby('Company').sum().loc['FB']

Sales    550
Name: FB, dtype: int64

In [27]:
df1.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   275.000000  150.000000  460.000000
      std    247.487373   70.710678  169.705627
      min    100.000000  100.000000  340.000000
      25%    187.500000  125.000000  400.000000
      50%    275.000000  150.000000  460.000000
      75%    362.500000  175.000000  520.000000
      max    450.000000  200.000000  580.000000

In [28]:
df1.groupby('Company').describe().loc['MSFT']

Sales  count      2.000000
       mean     460.000000
       std      169.705627
       min      340.000000
       25%      400.000000
       50%      460.000000
       75%      520.000000
       max      580.000000
Name: MSFT, dtype: float64